app/views/shouts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."shout_id" = ?  [["shout_id", 1]]
---
<h2>Comments</h2>
<% @shout.comments.each do |comment| %>