app/controllers/shouts_controller.rb

  def show
    @shout = Shout.find(params[:id])
    @user = User.find(session[:user_id])
---
SELECT  "shouts".* FROM "shouts" WHERE "shouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]